# ðŸ”„ Day 13: Advanced Reshaping (Pivot, Melt, Crosstab)

In [87]:
import pandas as pd

In [88]:
df_weather = pd.read_csv("weather_data.csv")
df_weather.head()

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/4/2017  new york           69        61
4  5/5/2017  new york           70        62

In [89]:
df_weather.pivot(index="date", columns="city")

         temperature                 humidity
city         beijing mumbai new york  beijing mumbai new york
date
5/1/2017          80     75       65       26     80       56
5/2/2017          77     78       66       30     83       58
5/3/2017          79     82       68       35     85       60
5/4/2017          78     83       69       38     86       61
5/5/2017          80     84       70       41     87       62
5/6/2017          82     85       70       44     88       64
5/7/2017          81     86       71       46     88       63

In [90]:
print("Only Humidity: \n")
df_weather.pivot(index="date", columns="city", values="humidity")

Only Humidity:

city      beijing  mumbai  new york
date
5/1/2017       26      80        56
5/2/2017       30      83        58
5/3/2017       35      85        60
5/4/2017       38      86        61
5/5/2017       41      87        62
5/6/2017       44      88        64
5/7/2017       46      88        63

In [91]:
print("Only Temperature: \n")
df_weather.pivot(index="date", columns="city", values="temperature")

Only Temperature:

city      beijing  mumbai  new york
date
5/1/2017       80      75        65
5/2/2017       77      78        66
5/3/2017       79      82        68
5/4/2017       78      83        69
5/5/2017       80      84        70
5/6/2017       82      85        70
5/7/2017       81      86        71

In [92]:
df = pd.read_csv("weather_data_extended.csv")
df.head()

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/1/2017  new york           61        54
2  5/2/2017  new york           70        60
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80

In [93]:
print("Humidity: \n")
df.pivot_table(index="city", columns="date", values="humidity")

Humidity:

date      5/1/2017  5/2/2017  5/3/2017  5/4/2017  5/5/2017
city
mumbai        81.5      55.5      85.0      87.5      88.5
new york      55.0      61.0      58.5      62.0      61.0

In [94]:
print("Temperature: \n")
df.pivot_table(index="city", columns="date", values="temperature")

Temperature:

date      5/1/2017  5/2/2017  5/3/2017  5/4/2017  5/5/2017
city
mumbai        76.5      81.0      82.0      84.5      86.5
new york      63.0      71.0      68.5      72.0      73.0

In [95]:
df.pivot_table(index="city", columns="date", aggfunc="sum")

         humidity                                     temperature           \
date     5/1/2017 5/2/2017 5/3/2017 5/4/2017 5/5/2017    5/1/2017 5/2/2017
city
mumbai        163      111      170      175      177         153      162
new york      110      122      117      124      122         126      142


date     5/3/2017 5/4/2017 5/5/2017
city
mumbai        164      169      173
new york      137      144      146

In [96]:
df.pivot_table(index="city", columns="date", aggfunc="mean")

         humidity                                     temperature           \
date     5/1/2017 5/2/2017 5/3/2017 5/4/2017 5/5/2017    5/1/2017 5/2/2017
city
mumbai       81.5     55.5     85.0     87.5     88.5        76.5     81.0
new york     55.0     61.0     58.5     62.0     61.0        63.0     71.0


date     5/3/2017 5/4/2017 5/5/2017
city
mumbai       82.0     84.5     86.5
new york     68.5     72.0     73.0

In [97]:
df.pivot_table(index="city", columns="date", aggfunc="count")

         humidity                                     temperature           \
date     5/1/2017 5/2/2017 5/3/2017 5/4/2017 5/5/2017    5/1/2017 5/2/2017
city
mumbai          2        2        2        2        2           2        2
new york        2        2        2        2        2           2        2


date     5/3/2017 5/4/2017 5/5/2017
city
mumbai          2        2        2
new york        2        2        2

In [98]:
df.pivot_table(index="city", columns="date", aggfunc="diff")

    humidity  temperature
1       -2.0         -4.0
3        2.0          2.0
5        3.0          3.0
7      -59.0         -2.0
9        1.0          1.0
11       2.0          2.0
13      -2.0         -2.0
15       1.0          1.0
17      -2.0         -2.0
19       1.0          1.0

In [99]:
df.pivot_table(index="city", columns="date", margins=True)

         humidity                                            temperature  \
date     5/1/2017 5/2/2017 5/3/2017 5/4/2017 5/5/2017    All    5/1/2017
city
mumbai      81.50    55.50    85.00    87.50    88.50  79.60       76.50
new york    55.00    61.00    58.50    62.00    61.00  59.50       63.00
All         68.25    58.25    71.75    74.75    74.75  69.55       69.75


date     5/2/2017 5/3/2017 5/4/2017 5/5/2017   All
city
mumbai       81.0    82.00    84.50    86.50  82.1
new york     71.0    68.50    72.00    73.00  69.5
All          76.0    75.25    78.25    79.75  75.8

In [100]:
df2 = pd.read_csv("combined_weather.csv")
df2.head()

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/1/2017  new york           61        54
2  5/2/2017  new york           70        60
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80

In [101]:
df2["date"] = pd.to_datetime(df["date"])
type(df2['date'][0])

pandas.Timestamp

In [102]:
df2.pivot_table(index=pd.Grouper(freq='ME', key='date'), columns='city', values='humidity')

city        mumbai   new york
date
2017-05-31    71.0  54.583333

In [103]:
df2.pivot_table(index=pd.Grouper(freq='ME', key='date'), columns='city', values='temperature')

city        mumbai  new york
date
2017-05-31  79.625      47.5